/**
 * Created by CoolGuy on 2016/5/3.
 * 该项目的公共提示信息部分的文字描述
 */

export default Words = {
    system:{
        error:'抱歉，系统繁忙，请稍候重试'
    },
    password:{
        non_empty:'请输入密码',
        login_non_empty:'请输入"登录密码"',
        confirm_non_empty:'请输入"确认密码"',
        not_right:'登录密码为：组合字母、数字或符号（6-20位），请重新输入',
        not_the_same:'两次输入的密码不一致，请重新输入'
    },
    mobile:{
        not_right:'请输入正确的手机号码',
    },
    phone:{
        not_right:'请输入正确的电话号码'
    },
    QQ:{
        not_right:"请输入正确的QQ号码"
    },
    shopName:{
        not_right:"店铺名称最长16个字",
        empty:"店铺名称不能为空"
    },
    userName:{
        not_right:'请输入手机号/倍棒账号'
    },
    captcha:{
        not_right:'请输入正确的验证码'
    },
    image:{
        type_not_allowed:'上传图片只允许JPG、JPEG、PNG、BMP格式的图片'
    },
    network:{
        not_work:"网络请求失败，请检查您的网络设置"
    },
    loading:{
        default:"加载中…",
        saving: "保存中…",
        changing:"修改中…",
        setting:"设置中…",
        verifying:"校验中…",
        deleting:"删除中…"
    },
    button:{
        cancel:"取消",
        submit:"确认"
    },
    shopMap:{
        not_saved:"你是否保存当前修改的店铺地址？"
    },
    payAgreement:{
        title:'倍棒快捷支付服务协议',
        content:'       快捷支付服务协议（以下简称“本协议”）是深圳市神州通付科技有限公司（以下简称“神州通付”）与神州通付倍棒用户(以下简称“用户”或“您”)就神州通付倍棒快捷支付服务（以下简称“本服务”）' +
        '的使用等相关事项所订立的有效合约。用户通过网络页面点击确认或以其他方式选择接受本协议，即表示用户与神州通付已达成协议并同意接受本协议的全部约定内容。\n' +
        '       在接受本协议之前，请您仔细阅读本协议的全部内容（特别是以粗体下划线标注的内容）。如果您不同意本协议的任意内容，或者无法准确理解神州通付对条款的解释，请不要进行后续操作。\n' +
        '       神州通付为您提供的快捷支付服务，指您在订购商品支付时，在线提供持卡人姓名、身份证号码、银行卡号、手机号码等信息，信用卡还需提供卡片有效期、cvv2等信息，神州通付将发送手机动态口令到您登记的手机上，' +
        '您输入正确的手机动态口令，即可完成支付。\n' +
        '       您应妥善保管卡、卡号、密码、身份证件信息以及神州通付倍棒账号、密码、数字证书等与银行卡或与神州通付倍棒账户有关的一切信息。如您遗失银行卡、身份证、手机，泄露神州通付倍棒账户密码或相关信息的，' +
        '您应及时通知发卡行及/或神州通付，以减少可能发生的损失。因用户或用户授权人泄露密码、数字证书、丢失银行卡、手机等所致损失需由用户自行承担。\n' +
        '       不应将本服务用于任何非法的或违反本协议的目的。\n' +
        '       用户如使用本服务进行支付的，应当在认真确认金额后输入密码进行支付。用户认可和同意：输入密码即视为用户确认交易和交易金额并已不可撤销地向神州通付发出指令，' +
        '神州通付有权根据用户的该指令委托银行或第三方从用户银行卡中划扣资金给收款人。届时用户不应以未在交易单据中签名、签名不符、非本人意愿交易等原因要求神州通付退款或承担其他责任。\n' +
        '       您在对使用本服务过程中发出指令的真实性及有效性承担全部责任；您承诺，神州通付依照您的指令进行操作的一切风险由您承担。\n' +
        '       用户认可神州通付倍棒账户的使用记录数据、交易金额数据等均以神州通付倍棒平台记录的数据为准。\n' +
        '       同时您授权神州通付有权留存您在神州通付网站填写的相应信息，以供后续向您持续性地提供相应服务（包括但不限于将本信息用于向您推广、提供其他更加优质的产品或服务）。\n' +
        '       出现下列情况之一的，神州通付有权立即终止用户使用神州通付相关服务而无需承担任何责任：（1）用户违反本协议的约定；（2）用户违反神州通付/或其他关联公司网站的条款、协议、规则、通告等相关规定，' +
        '而被上述任一网站终止提供服务的；（3）神州通付认为向您提供本服务存在风险的（4）您的银行卡有效期届满。\n' +
        '       您同意，本协议适用中华人民共和国大陆地区法律。因神州通付与您就本协议的签订、履行或解释发生争议，双方应努力友好协商解决。如协商不成，神州通付和用户同意由神州通付住所地法院管辖审理双方的纠纷或争议。\n' +
        '       本协议内容包括协议正文及所有神州通付已经发布的或将来可能发布的神州通付服务的使用规则。所有规则为本协议不可分割的一部分，与协议正文具有相同法律效力。若您在本协议内容发生修订后，继续使用本服务的，' +
        '则视为您同意最新修订的协议内容；否则您须立即停止使用本服务。\n' +
        '       本协议未尽事宜，用户需遵守神州通付倍棒网站上公布的《倍棒服务协议》及相关规则。'
    }
}
